# Chapter 10: Data Aggregation and Group Operations

In [1]:
import numpy as np
import pandas as pd

## 10.1: How to Think About Group Operations

In [2]:
df=pd.DataFrame({"key1":["a","a",None,"b","b","a",None],
                 "key2":pd.Series([1,2,1,2,1,None,1],dtype="Int64"),
                 "data1":np.random.standard_normal(7),
                 "data2":np.random.standard_normal(7)})
df

   key1  key2     data1     data2
0     a     1 -0.922777 -1.516412
1     a     2 -0.838157  1.224253
2  None     1  1.534372 -0.553134
3     b     2  0.985158 -0.347303
4     b     1 -0.591800  0.451640
5     a  <NA> -0.124712 -0.326200
6  None     1  0.741002  1.846095

In [3]:
grouped=df["data1"].groupby(df["key1"])
grouped

In [4]:
grouped.mean()

key1
a   -0.628548
b    0.196679
Name: data1, dtype: float64

In [5]:
grouped.value_counts()

key1  data1
a     -0.922777    1
      -0.838157    1
      -0.124712    1
b     -0.591800    1
       0.985158    1
Name: count, dtype: int64

In [6]:
means=df["data1"].groupby([df["key1"],df["key2"]]).mean()
means

key1  key2
a     1      -0.922777
      2      -0.838157
b     1      -0.591800
      2       0.985158
Name: data1, dtype: float64

In [7]:
means.unstack()

key2         1         2
key1
a    -0.922777 -0.838157
b    -0.591800  0.985158

In [8]:
states=np.array(["OH","CA","CA","OH","OH","CA","OH"])
years=[2005,2005,2006,2005,2006,2005,2006]
df

   key1  key2     data1     data2
0     a     1 -0.922777 -1.516412
1     a     2 -0.838157  1.224253
2  None     1  1.534372 -0.553134
3     b     2  0.985158 -0.347303
4     b     1 -0.591800  0.451640
5     a  <NA> -0.124712 -0.326200
6  None     1  0.741002  1.846095

In [9]:
df["states"]=states
df["years"]=years
df

   key1  key2     data1     data2 states  years
0     a     1 -0.922777 -1.516412     OH   2005
1     a     2 -0.838157  1.224253     CA   2005
2  None     1  1.534372 -0.553134     CA   2006
3     b     2  0.985158 -0.347303     OH   2005
4     b     1 -0.591800  0.451640     OH   2006
5     a  <NA> -0.124712 -0.326200     CA   2005
6  None     1  0.741002  1.846095     OH   2006

In [10]:
df1=df["data1"]
df1

0   -0.922777
1   -0.838157
2    1.534372
3    0.985158
4   -0.591800
5   -0.124712
6    0.741002
Name: data1, dtype: float64

In [11]:
df1.groupby([states,years]).mean()

CA  2005   -0.481434
    2006    1.534372
OH  2005    0.031191
    2006    0.074601
Name: data1, dtype: float64

In [12]:
df=df.drop(columns=["states","years"])

In [13]:
df

   key1  key2     data1     data2
0     a     1 -0.922777 -1.516412
1     a     2 -0.838157  1.224253
2  None     1  1.534372 -0.553134
3     b     2  0.985158 -0.347303
4     b     1 -0.591800  0.451640
5     a  <NA> -0.124712 -0.326200
6  None     1  0.741002  1.846095

In [14]:
df.groupby("key1").mean()

      key2     data1     data2
key1
a      1.5 -0.628548 -0.206120
b      1.5  0.196679  0.052169

In [15]:
df.groupby("key2").mean(numeric_only=True)

         data1     data2
key2
1     0.190200  0.057047
2     0.073501  0.438475

In [16]:
df.groupby(["key1","key2"]).mean()

              data1     data2
key1 key2
a    1    -0.922777 -1.516412
     2    -0.838157  1.224253
b    1    -0.591800  0.451640
     2     0.985158 -0.347303

In [17]:
df

   key1  key2     data1     data2
0     a     1 -0.922777 -1.516412
1     a     2 -0.838157  1.224253
2  None     1  1.534372 -0.553134
3     b     2  0.985158 -0.347303
4     b     1 -0.591800  0.451640
5     a  <NA> -0.124712 -0.326200
6  None     1  0.741002  1.846095

In [18]:
df.groupby(["key1","key2"]).size()

key1  key2
a     1       1
      2       1
b     1       1
      2       1
dtype: int64

In [19]:
df.groupby(["key1","key2"],dropna=False).size()

key1  key2
a     1       1
      2       1
      <NA>    1
b     1       1
      2       1
NaN   1       2
dtype: int64

In [20]:
df.groupby("key1").count()

      key2  data1  data2
key1
a        2      3      3
b        2      2      2

In [21]:
df.groupby("key1").size()

key1
a    3
b    2
dtype: int64

### Iterating over Groups

In [22]:
for name,group in df.groupby("key1"):
    print(name)
    print(group)

a
  key1  key2     data1     data2
0    a     1 -0.922777 -1.516412
1    a     2 -0.838157  1.224253
5    a  <NA> -0.124712 -0.326200
b
  key1  key2     data1     data2
3    b     2  0.985158 -0.347303
4    b     1 -0.591800  0.451640

In [23]:
for (k1,k2),group in df.groupby(["key1","key2"]):
    print(k1)
    print(k2)
    print(group)

a
1
  key1  key2     data1     data2
0    a     1 -0.922777 -1.516412
a
2
  key1  key2     data1     data2
1    a     2 -0.838157  1.224253
b
1
  key1  key2   data1    data2
4    b     1 -0.5918  0.45164
b
2
  key1  key2     data1     data2
3    b     2  0.985158 -0.347303

In [24]:
pieces={name:group for name,group in df.groupby("key1")}
pieces

{'a':   key1  key2     data1     data2
 0    a     1 -0.922777 -1.516412
 1    a     2 -0.838157  1.224253
 5    a  <NA> -0.124712 -0.326200,
 'b':   key1  key2     data1     data2
 3    b     2  0.985158 -0.347303
 4    b     1 -0.591800  0.451640}

In [25]:
pieces["b"]

  key1  key2     data1     data2
3    b     2  0.985158 -0.347303
4    b     1 -0.591800  0.451640

In [26]:
df

   key1  key2     data1     data2
0     a     1 -0.922777 -1.516412
1     a     2 -0.838157  1.224253
2  None     1  1.534372 -0.553134
3     b     2  0.985158 -0.347303
4     b     1 -0.591800  0.451640
5     a  <NA> -0.124712 -0.326200
6  None     1  0.741002  1.846095

In [27]:
grouped=df.groupby({"key1":"key","key2":"key","data1":"data","data2":"data"},axis="columns")
grouped

C:\Users\Karim.Badr\AppData\Local\Temp\ipykernel_25252\1160632884.py:1: FutureWarning: DataFrame.groupby with axis=1 is deprecated. Do `frame.T.groupby(...)` without axis instead.
  grouped=df.groupby({"key1":"key","key2":"key","data1":"data","data2":"data"},axis="columns")

In [28]:
df.T

              0         1         2         3        4         5         6
key1          a         a      None         b        b         a      None
key2          1         2         1         2        1      <NA>         1
data1 -0.922777 -0.838157  1.534372  0.985158  -0.5918 -0.124712  0.741002
data2 -1.516412  1.224253 -0.553134 -0.347303  0.45164   -0.3262  1.846095

In [29]:
list(grouped)

[('data',
        data1     data2
  0 -0.922777 -1.516412
  1 -0.838157  1.224253
  2  1.534372 -0.553134
  3  0.985158 -0.347303
  4 -0.591800  0.451640
  5 -0.124712 -0.326200
  6  0.741002  1.846095),
 ('key',
     key1  key2
  0     a     1
  1     a     2
  2  None     1
  3     b     2
  4     b     1
  5     a  <NA>
  6  None     1)]

In [30]:
for group_key,group_values in grouped:
    print(group_key)
    print(group_values)

data
      data1     data2
0 -0.922777 -1.516412
1 -0.838157  1.224253
2  1.534372 -0.553134
3  0.985158 -0.347303
4 -0.591800  0.451640
5 -0.124712 -0.326200
6  0.741002  1.846095
key
   key1  key2
0     a     1
1     a     2
2  None     1
3     b     2
4     b     1
5     a  <NA>
6  None     1

### Selecting a Column or Subset of Columns

In [31]:
list(df.groupby("key1")["data1"])

[('a',
  0   -0.922777
  1   -0.838157
  5   -0.124712
  Name: data1, dtype: float64),
 ('b',
  3    0.985158
  4   -0.591800
  Name: data1, dtype: float64)]

In [32]:
list(df["data1"].groupby(df["key1"]))

[('a',
  0   -0.922777
  1   -0.838157
  5   -0.124712
  Name: data1, dtype: float64),
 ('b',
  3    0.985158
  4   -0.591800
  Name: data1, dtype: float64)]

In [33]:
df.groupby(["key1","key2"])[["data2"]].mean()

              data2
key1 key2
a    1    -1.516412
     2     1.224253
b    1     0.451640
     2    -0.347303

In [34]:
df.groupby(["key1", "key2"])["data2"].mean()

key1  key2
a     1      -1.516412
      2       1.224253
b     1       0.451640
      2      -0.347303
Name: data2, dtype: float64

### Grouping with Dictionaries and Series

In [35]:
people=pd.DataFrame(np.random.standard_normal((5,5)),
                    columns=["a","b","c","d","e"],
                    index=["Joe","Steve","Wanda","Jill","Trey"])
people

              a         b         c         d         e
Joe    0.414549 -1.475493  0.821092  0.729569  0.264797
Steve  1.177361 -0.325011  0.060358 -1.504812 -0.164848
Wanda -0.953338  0.311632 -1.636776  0.123149  1.111949
Jill  -1.035872 -0.420272  1.113017 -0.321133  1.236514
Trey  -0.996007  0.381040 -1.130701  1.195607 -0.786891

In [36]:
people.iloc[2,[1,2]]=np.nan
people

              a         b         c         d         e
Joe    0.414549 -1.475493  0.821092  0.729569  0.264797
Steve  1.177361 -0.325011  0.060358 -1.504812 -0.164848
Wanda -0.953338       NaN       NaN  0.123149  1.111949
Jill  -1.035872 -0.420272  1.113017 -0.321133  1.236514
Trey  -0.996007  0.381040 -1.130701  1.195607 -0.786891

In [37]:
mapping={"a":"red","b":"red","c":"blue","d":"blue","e":"red","f":"orange"}

In [38]:
by_column=people.groupby(mapping,axis="columns")
by_column.sum()

C:\Users\Karim.Badr\AppData\Local\Temp\ipykernel_25252\1683895776.py:1: FutureWarning: DataFrame.groupby with axis=1 is deprecated. Do `frame.T.groupby(...)` without axis instead.
  by_column=people.groupby(mapping,axis="columns")

           blue       red
Joe    1.550661 -0.796147
Steve -1.444455  0.687502
Wanda  0.123149  0.158611
Jill   0.791884 -0.219629
Trey   0.064906 -1.401857

In [39]:
map_series=pd.Series(mapping)
map_series

a       red
b       red
c      blue
d      blue
e       red
f    orange
dtype: object

In [40]:
people.groupby(map_series,axis="columns").sum()

C:\Users\Karim.Badr\AppData\Local\Temp\ipykernel_25252\1495142927.py:1: FutureWarning: DataFrame.groupby with axis=1 is deprecated. Do `frame.T.groupby(...)` without axis instead.
  people.groupby(map_series,axis="columns").sum()

           blue       red
Joe    1.550661 -0.796147
Steve -1.444455  0.687502
Wanda  0.123149  0.158611
Jill   0.791884 -0.219629
Trey   0.064906 -1.401857

### Grouping with Functions

In [41]:
people.groupby(len).sum()

          a         b         c         d         e
3  0.414549 -1.475493  0.821092  0.729569  0.264797
4 -2.031879 -0.039231 -0.017684  0.874474  0.449623
5  0.224023 -0.325011  0.060358 -1.381664  0.947101

In [42]:
people

              a         b         c         d         e
Joe    0.414549 -1.475493  0.821092  0.729569  0.264797
Steve  1.177361 -0.325011  0.060358 -1.504812 -0.164848
Wanda -0.953338       NaN       NaN  0.123149  1.111949
Jill  -1.035872 -0.420272  1.113017 -0.321133  1.236514
Trey  -0.996007  0.381040 -1.130701  1.195607 -0.786891

In [43]:
key_list=["one","one","one","two","two"]
people.groupby([len,key_list]).min()

              a         b         c         d         e
3 one  0.414549 -1.475493  0.821092  0.729569  0.264797
4 two -1.035872 -0.420272 -1.130701 -0.321133 -0.786891
5 one -0.953338 -0.325011  0.060358 -1.504812 -0.164848

In [44]:
list(people.groupby([len,key_list]))

[((3, 'one'),
              a         b         c         d         e
  Joe  0.414549 -1.475493  0.821092  0.729569  0.264797),
 ((4, 'two'),
               a         b         c         d         e
  Jill -1.035872 -0.420272  1.113017 -0.321133  1.236514
  Trey -0.996007  0.381040 -1.130701  1.195607 -0.786891),
 ((5, 'one'),
                a         b         c         d         e
  Steve  1.177361 -0.325011  0.060358 -1.504812 -0.164848
  Wanda -0.953338       NaN       NaN  0.123149  1.111949)]

### Grouping by Index Levels

In [45]:
columns=pd.MultiIndex.from_arrays([["US","US","US","JP","JP"],
                                   [1,3,5,1,3]],
                                   names=["cty","tenor"])
columns

MultiIndex([('US', 1),
            ('US', 3),
            ('US', 5),
            ('JP', 1),
            ('JP', 3)],
           names=['cty', 'tenor'])

In [46]:
hier_df=pd.DataFrame(np.random.standard_normal((4,5)),columns=columns)
hier_df

cty          US                            JP
tenor         1         3         5         1         3
0      1.457694 -0.439418  0.464202  1.287013  0.913776
1      0.573183 -1.348563  0.759582  0.325169  1.328441
2      1.769417 -0.656663 -0.270215 -0.108435  0.642556
3      1.460748 -0.940170 -1.580310  1.103507 -0.544047

In [47]:
hier_df.groupby(level="cty",axis="columns").count()

C:\Users\Karim.Badr\AppData\Local\Temp\ipykernel_25252\1991154737.py:1: FutureWarning: DataFrame.groupby with axis=1 is deprecated. Do `frame.T.groupby(...)` without axis instead.
  hier_df.groupby(level="cty",axis="columns").count()

cty  JP  US
0     2   3
1     2   3
2     2   3
3     2   3

## 10.2: Data Aggregation

In [48]:
df

   key1  key2     data1     data2
0     a     1 -0.922777 -1.516412
1     a     2 -0.838157  1.224253
2  None     1  1.534372 -0.553134
3     b     2  0.985158 -0.347303
4     b     1 -0.591800  0.451640
5     a  <NA> -0.124712 -0.326200
6  None     1  0.741002  1.846095

In [49]:
grouped=df.groupby("key1")
grouped["data1"].nsmallest(2)

key1
a     0   -0.922777
      1   -0.838157
b     4   -0.591800
      3    0.985158
Name: data1, dtype: float64

In [50]:
def peak_to_peak(arr):
    return arr.max()-arr.min()

In [51]:
grouped.agg(peak_to_peak)

      key2     data1     data2
key1
a        1  0.798065  2.740665
b        1  1.576958  0.798943

In [52]:
list(grouped)

[('a',
    key1  key2     data1     data2
  0    a     1 -0.922777 -1.516412
  1    a     2 -0.838157  1.224253
  5    a  <NA> -0.124712 -0.326200),
 ('b',
    key1  key2     data1     data2
  3    b     2  0.985158 -0.347303
  4    b     1 -0.591800  0.451640)]

In [53]:
grouped.describe()

      key2                                           data1            ...  \
     count mean       std  min   25%  50%   75%  max count      mean  ...
key1                                                                  ...
a      2.0  1.5  0.707107  1.0  1.25  1.5  1.75  2.0   3.0 -0.628548  ...
b      2.0  1.5  0.707107  1.0  1.25  1.5  1.75  2.0   2.0  0.196679  ...

                         data2                                          \
           75%       max count      mean       std       min       25%
key1
a    -0.481434 -0.124712   3.0 -0.206120  1.374273 -1.516412 -0.921306
b     0.590919  0.985158   2.0  0.052169  0.564938 -0.347303 -0.147567


           50%       75%       max
key1
a    -0.326200  0.449027  1.224253
b     0.052169  0.251904  0.451640

[2 rows x 24 columns]

### Column-Wise and Multiple Function Application

In [54]:
tips=pd.read_csv("../../examples/tips.csv")
tips["tip_pct"]=tips["tip"]/tips["total_bill"]
tips

     total_bill   tip smoker   day    time  size   tip_pct
0         16.99  1.01     No   Sun  Dinner     2  0.059447
1         10.34  1.66     No   Sun  Dinner     3  0.160542
2         21.01  3.50     No   Sun  Dinner     3  0.166587
3         23.68  3.31     No   Sun  Dinner     2  0.139780
4         24.59  3.61     No   Sun  Dinner     4  0.146808
..          ...   ...    ...   ...     ...   ...       ...
239       29.03  5.92     No   Sat  Dinner     3  0.203927
240       27.18  2.00    Yes   Sat  Dinner     2  0.073584
241       22.67  2.00    Yes   Sat  Dinner     2  0.088222
242       17.82  1.75     No   Sat  Dinner     2  0.098204
243       18.78  3.00     No  Thur  Dinner     2  0.159744

[244 rows x 7 columns]

In [55]:
grouped=tips.groupby(["day","smoker"])
list(grouped)

[(('Fri', 'No'),
       total_bill   tip smoker  day    time  size   tip_pct
  91        22.49  3.50     No  Fri  Dinner     2  0.155625
  94        22.75  3.25     No  Fri  Dinner     2  0.142857
  99        12.46  1.50     No  Fri  Dinner     2  0.120385
  223       15.98  3.00     No  Fri   Lunch     3  0.187735),
 (('Fri', 'Yes'),
       total_bill   tip smoker  day    time  size   tip_pct
  90        28.97  3.00    Yes  Fri  Dinner     2  0.103555
  92         5.75  1.00    Yes  Fri  Dinner     2  0.173913
  93        16.32  4.30    Yes  Fri  Dinner     2  0.263480
  95        40.17  4.73    Yes  Fri  Dinner     4  0.117750
  96        27.28  4.00    Yes  Fri  Dinner     2  0.146628
  97        12.03  1.50    Yes  Fri  Dinner     2  0.124688
  98        21.01  3.00    Yes  Fri  Dinner     2  0.142789
  100       11.35  2.50    Yes  Fri  Dinner     2  0.220264
  101       15.38  3.00    Yes  Fri  Dinner     2  0.195059
  220       12.16  2.20    Yes  Fri   Lunch     2  0.180921
  221       13.42  3.48    Yes  Fri   Lunch     2  0.259314
  222        8.58  1.92    Yes  Fri   Lunch     1  0.223776
  224       13.42  1.58    Yes  Fri   Lunch     2  0.117735
  225       16.27  2.50    Yes  Fri   Lunch     2  0.153657
  226       10.09  2.00    Yes  Fri   Lunch     2  0.198216),
 (('Sat', 'No'),
       total_bill   tip smoker  day    time  size   tip_pct
  19        20.65  3.35     No  Sat  Dinner     3  0.162228
  20        17.92  4.08     No  Sat  Dinner     2  0.227679
  21        20.29  2.75     No  Sat  Dinner     2  0.135535
  22        15.77  2.23     No  Sat  Dinner     2  0.141408
  23        39.42  7.58     No  Sat  Dinner     4  0.192288
  24        19.82  3.18     No  Sat  Dinner     2  0.160444
  25        17.81  2.34     No  Sat  Dinner     4  0.131387
  26        13.37  2.00     No  Sat  Dinner     2  0.149589
  27        12.69  2.00     No  Sat  Dinner     2  0.157604
  28        21.70  4.30     No  Sat  Dinner     2  0.198157
  29        19.65  3.00     No  Sat  Dinner     2  0.152672
  30         9.55  1.45     No  Sat  Dinner     2  0.151832
  31        18.35  2.50     No  Sat  Dinner     4  0.136240
  32        15.06  3.00     No  Sat  Dinner     2  0.199203
  33        20.69  2.45     No  Sat  Dinner     4  0.118415
  34        17.78  3.27     No  Sat  Dinner     2  0.183915
  35        24.06  3.60     No  Sat  Dinner     3  0.149626
  36        16.31  2.00     No  Sat  Dinner     3  0.122624
  37        16.93  3.07     No  Sat  Dinner     3  0.181335
  38        18.69  2.31     No  Sat  Dinner     3  0.123596
  39        31.27  5.00     No  Sat  Dinner     3  0.159898
  40        16.04  2.24     No  Sat  Dinner     3  0.139651
  57        26.41  1.50     No  Sat  Dinner     2  0.056797
  59        48.27  6.73     No  Sat  Dinner     4  0.139424
  64        17.59  2.64     No  Sat  Dinner     3  0.150085
  65        20.08  3.15     No  Sat  Dinner     3  0.156873
  66        16.45  2.47     No  Sat  Dinner     2  0.150152
  68        20.23  2.01     No  Sat  Dinner     2  0.099357
  70        12.02  1.97     No  Sat  Dinner     2  0.163894
  71        17.07  3.00     No  Sat  Dinner     3  0.175747
  74        14.73  2.20     No  Sat  Dinner     2  0.149355
  75        10.51  1.25     No  Sat  Dinner     2  0.118934
  104       20.92  4.08     No  Sat  Dinner     2  0.195029
  108       18.24  3.76     No  Sat  Dinner     2  0.206140
  110       14.00  3.00     No  Sat  Dinner     2  0.214286
  111        7.25  1.00     No  Sat  Dinner     1  0.137931
  212       48.33  9.00     No  Sat  Dinner     4  0.186220
  227       20.45  3.00     No  Sat  Dinner     4  0.146699
  228       13.28  2.72     No  Sat  Dinner     2  0.204819
  232       11.61  3.39     No  Sat  Dinner     2  0.291990
  233       10.77  1.47     No  Sat  Dinner     2  0.136490
  235       10.07  1.25     No  Sat  Dinner     2  0.124131
  238       35.83  4.67     No  Sat  Dinner     3  0.130338
  239       29.03  5.92     No  Sat  Dinner     3  0.203927
  242       17.82  1.75     No  Sat  Dinner     2  0.098204),
 (('Sat', 'Yes'),
       total_bill    tip smoker  day    time  size   tip_pct
  56        38.01   3.00    Yes  Sat  Dinner     4  0.078927
  58        11.24   1.76    Yes  Sat  Dinner     2  0.156584
  60        20.29   3.21    Yes  Sat  Dinner     2  0.158206
  61        13.81   2.00    Yes  Sat  Dinner     2  0.144823
  62        11.02   1.98    Yes  Sat  Dinner     2  0.179673
  63        18.29   3.76    Yes  Sat  Dinner     4  0.205577
  67         3.07   1.00    Yes  Sat  Dinner     1  0.325733
  69        15.01   2.09    Yes  Sat  Dinner     2  0.139241
  72        26.86   3.14    Yes  Sat  Dinner     2  0.116902
  73        25.28   5.00    Yes  Sat  Dinner     2  0.197785
  76        17.92   3.08    Yes  Sat  Dinner     2  0.171875
  102       44.30   2.50    Yes  Sat  Dinner     3  0.056433
  103       22.42   3.48    Yes  Sat  Dinner     2  0.155219
  105       15.36   1.64    Yes  Sat  Dinner     2  0.106771
  106       20.49   4.06    Yes  Sat  Dinner     2  0.198145
  107       25.21   4.29    Yes  Sat  Dinner     2  0.170171
  109       14.31   4.00    Yes  Sat  Dinner     2  0.279525
  168       10.59   1.61    Yes  Sat  Dinner     2  0.152030
  169       10.63   2.00    Yes  Sat  Dinner     2  0.188147
  170       50.81  10.00    Yes  Sat  Dinner     3  0.196812
  171       15.81   3.16    Yes  Sat  Dinner     2  0.199873
  206       26.59   3.41    Yes  Sat  Dinner     3  0.128244
  207       38.73   3.00    Yes  Sat  Dinner     4  0.077459
  208       24.27   2.03    Yes  Sat  Dinner     2  0.083642
  209       12.76   2.23    Yes  Sat  Dinner     2  0.174765
  210       30.06   2.00    Yes  Sat  Dinner     3  0.066534
  211       25.89   5.16    Yes  Sat  Dinner     4  0.199305
  213       13.27   2.50    Yes  Sat  Dinner     2  0.188395
  214       28.17   6.50    Yes  Sat  Dinner     3  0.230742
  215       12.90   1.10    Yes  Sat  Dinner     2  0.085271
  216       28.15   3.00    Yes  Sat  Dinner     5  0.106572
  217       11.59   1.50    Yes  Sat  Dinner     2  0.129422
  218        7.74   1.44    Yes  Sat  Dinner     2  0.186047
  219       30.14   3.09    Yes  Sat  Dinner     4  0.102522
  229       22.12   2.88    Yes  Sat  Dinner     2  0.130199
  230       24.01   2.00    Yes  Sat  Dinner     4  0.083299
  231       15.69   3.00    Yes  Sat  Dinner     3  0.191205
  234       15.53   3.00    Yes  Sat  Dinner     2  0.193175
  236       12.60   1.00    Yes  Sat  Dinner     2  0.079365
  237       32.83   1.17    Yes  Sat  Dinner     2  0.035638
  240       27.18   2.00    Yes  Sat  Dinner     2  0.073584
  241       22.67   2.00    Yes  Sat  Dinner     2  0.088222),
 (('Sun', 'No'),
       total_bill   tip smoker  day    time  size   tip_pct
  0         16.99  1.01     No  Sun  Dinner     2  0.059447
  1         10.34  1.66     No  Sun  Dinner     3  0.160542
  2         21.01  3.50     No  Sun  Dinner     3  0.166587
  3         23.68  3.31     No  Sun  Dinner     2  0.139780
  4         24.59  3.61     No  Sun  Dinner     4  0.146808
  5         25.29  4.71     No  Sun  Dinner     4  0.186240
  6          8.77  2.00     No  Sun  Dinner     2  0.228050
  7         26.88  3.12     No  Sun  Dinner     4  0.116071
  8         15.04  1.96     No  Sun  Dinner     2  0.130319
  9         14.78  3.23     No  Sun  Dinner     2  0.218539
  10        10.27  1.71     No  Sun  Dinner     2  0.166504
  11        35.26  5.00     No  Sun  Dinner     4  0.141804
  12        15.42  1.57     No  Sun  Dinner     2  0.101816
  13        18.43  3.00     No  Sun  Dinner     4  0.162778
  14        14.83  3.02     No  Sun  Dinner     2  0.203641
  15        21.58  3.92     No  Sun  Dinner     2  0.181650
  16        10.33  1.67     No  Sun  Dinner     3  0.161665
  17        16.29  3.71     No  Sun  Dinner     3  0.227747
  18        16.97  3.50     No  Sun  Dinner     3  0.206246
  41        17.46  2.54     No  Sun  Dinner     2  0.145475
  42        13.94  3.06     No  Sun  Dinner     2  0.219512
  43         9.68  1.32     No  Sun  Dinner     2  0.136364
  44        30.40  5.60     No  Sun  Dinner     4  0.184211
  45        18.29  3.00     No  Sun  Dinner     2  0.164024
  46        22.23  5.00     No  Sun  Dinner     2  0.224921
  47        32.40  6.00     No  Sun  Dinner     4  0.185185
  48        28.55  2.05     No  Sun  Dinner     3  0.071804
  49        18.04  3.00     No  Sun  Dinner     2  0.166297
  50        12.54  2.50     No  Sun  Dinner     2  0.199362
  51        10.29  2.60     No  Sun  Dinner     2  0.252672
  52        34.81  5.20     No  Sun  Dinner     4  0.149382
  53         9.94  1.56     No  Sun  Dinner     2  0.156942
  54        25.56  4.34     No  Sun  Dinner     4  0.169797
  55        19.49  3.51     No  Sun  Dinner     2  0.180092
  112       38.07  4.00     No  Sun  Dinner     3  0.105070
  113       23.95  2.55     No  Sun  Dinner     2  0.106472
  114       25.71  4.00     No  Sun  Dinner     3  0.155581
  115       17.31  3.50     No  Sun  Dinner     2  0.202195
  116       29.93  5.07     No  Sun  Dinner     4  0.169395
  150       14.07  2.50     No  Sun  Dinner     2  0.177683
  151       13.13  2.00     No  Sun  Dinner     2  0.152323
  152       17.26  2.74     No  Sun  Dinner     3  0.158749
  153       24.55  2.00     No  Sun  Dinner     4  0.081466
  154       19.77  2.00     No  Sun  Dinner     4  0.101163
  155       29.85  5.14     No  Sun  Dinner     5  0.172194
  156       48.17  5.00     No  Sun  Dinner     6  0.103799
  157       25.00  3.75     No  Sun  Dinner     4  0.150000
  158       13.39  2.61     No  Sun  Dinner     2  0.194922
  159       16.49  2.00     No  Sun  Dinner     4  0.121286
  160       21.50  3.50     No  Sun  Dinner     4  0.162791
  161       12.66  2.50     No  Sun  Dinner     2  0.197472
  162       16.21  2.00     No  Sun  Dinner     3  0.123381
  163       13.81  2.00     No  Sun  Dinner     2  0.144823
  165       24.52  3.48     No  Sun  Dinner     3  0.141925
  166       20.76  2.24     No  Sun  Dinner     2  0.107900
  167       31.71  4.50     No  Sun  Dinner     4  0.141911
  185       20.69  5.00     No  Sun  Dinner     5  0.241663),
 (('Sun', 'Yes'),
       total_bill   tip smoker  day    time  size   tip_pct
  164       17.51  3.00    Yes  Sun  Dinner     2  0.171331
  172        7.25  5.15    Yes  Sun  Dinner     2  0.710345
  173       31.85  3.18    Yes  Sun  Dinner     2  0.099843
  174       16.82  4.00    Yes  Sun  Dinner     2  0.237812
  175       32.90  3.11    Yes  Sun  Dinner     2  0.094529
  176       17.89  2.00    Yes  Sun  Dinner     2  0.111794
  177       14.48  2.00    Yes  Sun  Dinner     2  0.138122
  178        9.60  4.00    Yes  Sun  Dinner     2  0.416667
  179       34.63  3.55    Yes  Sun  Dinner     2  0.102512
  180       34.65  3.68    Yes  Sun  Dinner     4  0.106205
  181       23.33  5.65    Yes  Sun  Dinner     2  0.242177
  182       45.35  3.50    Yes  Sun  Dinner     3  0.077178
  183       23.17  6.50    Yes  Sun  Dinner     4  0.280535
  184       40.55  3.00    Yes  Sun  Dinner     2  0.073983
  186       20.90  3.50    Yes  Sun  Dinner     3  0.167464
  187       30.46  2.00    Yes  Sun  Dinner     5  0.065660
  188       18.15  3.50    Yes  Sun  Dinner     3  0.192837
  189       23.10  4.00    Yes  Sun  Dinner     3  0.173160
  190       15.69  1.50    Yes  Sun  Dinner     2  0.095602),
 (('Thur', 'No'),
       total_bill   tip smoker   day    time  size   tip_pct
  77        27.20  4.00     No  Thur   Lunch     4  0.147059
  78        22.76  3.00     No  Thur   Lunch     2  0.131810
  79        17.29  2.71     No  Thur   Lunch     2  0.156738
  81        16.66  3.40     No  Thur   Lunch     2  0.204082
  82        10.07  1.83     No  Thur   Lunch     1  0.181728
  84        15.98  2.03     No  Thur   Lunch     2  0.127034
  85        34.83  5.17     No  Thur   Lunch     4  0.148435
  86        13.03  2.00     No  Thur   Lunch     2  0.153492
  87        18.28  4.00     No  Thur   Lunch     2  0.218818
  88        24.71  5.85     No  Thur   Lunch     2  0.236746
  89        21.16  3.00     No  Thur   Lunch     2  0.141777
  117       10.65  1.50     No  Thur   Lunch     2  0.140845
  118       12.43  1.80     No  Thur   Lunch     2  0.144811
  119       24.08  2.92     No  Thur   Lunch     4  0.121262
  120       11.69  2.31     No  Thur   Lunch     2  0.197605
  121       13.42  1.68     No  Thur   Lunch     2  0.125186
  122       14.26  2.50     No  Thur   Lunch     2  0.175316
  123       15.95  2.00     No  Thur   Lunch     2  0.125392
  124       12.48  2.52     No  Thur   Lunch     2  0.201923
  125       29.80  4.20     No  Thur   Lunch     6  0.140940
  126        8.52  1.48     No  Thur   Lunch     2  0.173709
  127       14.52  2.00     No  Thur   Lunch     2  0.137741
  128       11.38  2.00     No  Thur   Lunch     2  0.175747
  129       22.82  2.18     No  Thur   Lunch     3  0.095530
  130       19.08  1.50     No  Thur   Lunch     2  0.078616
  131       20.27  2.83     No  Thur   Lunch     2  0.139615
  132       11.17  1.50     No  Thur   Lunch     2  0.134288
  133       12.26  2.00     No  Thur   Lunch     2  0.163132
  134       18.26  3.25     No  Thur   Lunch     2  0.177985
  135        8.51  1.25     No  Thur   Lunch     2  0.146886
  136       10.33  2.00     No  Thur   Lunch     2  0.193611
  137       14.15  2.00     No  Thur   Lunch     2  0.141343
  139       13.16  2.75     No  Thur   Lunch     2  0.208967
  140       17.47  3.50     No  Thur   Lunch     2  0.200343
  141       34.30  6.70     No  Thur   Lunch     6  0.195335
  142       41.19  5.00     No  Thur   Lunch     5  0.121389
  143       27.05  5.00     No  Thur   Lunch     6  0.184843
  144       16.43  2.30     No  Thur   Lunch     2  0.139988
  145        8.35  1.50     No  Thur   Lunch     2  0.179641
  146       18.64  1.36     No  Thur   Lunch     3  0.072961
  147       11.87  1.63     No  Thur   Lunch     2  0.137321
  148        9.78  1.73     No  Thur   Lunch     2  0.176892
  149        7.51  2.00     No  Thur   Lunch     2  0.266312
  195        7.56  1.44     No  Thur   Lunch     2  0.190476
  243       18.78  3.00     No  Thur  Dinner     2  0.159744),
 (('Thur', 'Yes'),
       total_bill   tip smoker   day   time  size   tip_pct
  80        19.44  3.00    Yes  Thur  Lunch     2  0.154321
  83        32.68  5.00    Yes  Thur  Lunch     2  0.152999
  138       16.00  2.00    Yes  Thur  Lunch     2  0.125000
  191       19.81  4.19    Yes  Thur  Lunch     2  0.211509
  192       28.44  2.56    Yes  Thur  Lunch     2  0.090014
  193       15.48  2.02    Yes  Thur  Lunch     2  0.130491
  194       16.58  4.00    Yes  Thur  Lunch     2  0.241255
  196       10.34  2.00    Yes  Thur  Lunch     2  0.193424
  197       43.11  5.00    Yes  Thur  Lunch     4  0.115982
  198       13.00  2.00    Yes  Thur  Lunch     2  0.153846
  199       13.51  2.00    Yes  Thur  Lunch     2  0.148038
  200       18.71  4.00    Yes  Thur  Lunch     3  0.213789
  201       12.74  2.01    Yes  Thur  Lunch     2  0.157771
  202       13.00  2.00    Yes  Thur  Lunch     2  0.153846
  203       16.40  2.50    Yes  Thur  Lunch     2  0.152439
  204       20.53  4.00    Yes  Thur  Lunch     4  0.194837
  205       16.47  3.23    Yes  Thur  Lunch     3  0.196114)]

In [56]:
grouped_pct=grouped["tip_pct"]
list(grouped_pct)

[(('Fri', 'No'),
  91     0.155625
  94     0.142857
  99     0.120385
  223    0.187735
  Name: tip_pct, dtype: float64),
 (('Fri', 'Yes'),
  90     0.103555
  92     0.173913
  93     0.263480
  95     0.117750
  96     0.146628
  97     0.124688
  98     0.142789
  100    0.220264
  101    0.195059
  220    0.180921
  221    0.259314
  222    0.223776
  224    0.117735
  225    0.153657
  226    0.198216
  Name: tip_pct, dtype: float64),
 (('Sat', 'No'),
  19     0.162228
  20     0.227679
  21     0.135535
  22     0.141408
  23     0.192288
  24     0.160444
  25     0.131387
  26     0.149589
  27     0.157604
  28     0.198157
  29     0.152672
  30     0.151832
  31     0.136240
  32     0.199203
  33     0.118415
  34     0.183915
  35     0.149626
  36     0.122624
  37     0.181335
  38     0.123596
  39     0.159898
  40     0.139651
  57     0.056797
  59     0.139424
  64     0.150085
  65     0.156873
  66     0.150152
  68     0.099357
  70     0.163894
  71     0.175747
  74     0.149355
  75     0.118934
  104    0.195029
  108    0.206140
  110    0.214286
  111    0.137931
  212    0.186220
  227    0.146699
  228    0.204819
  232    0.291990
  233    0.136490
  235    0.124131
  238    0.130338
  239    0.203927
  242    0.098204
  Name: tip_pct, dtype: float64),
 (('Sat', 'Yes'),
  56     0.078927
  58     0.156584
  60     0.158206
  61     0.144823
  62     0.179673
  63     0.205577
  67     0.325733
  69     0.139241
  72     0.116902
  73     0.197785
  76     0.171875
  102    0.056433
  103    0.155219
  105    0.106771
  106    0.198145
  107    0.170171
  109    0.279525
  168    0.152030
  169    0.188147
  170    0.196812
  171    0.199873
  206    0.128244
  207    0.077459
  208    0.083642
  209    0.174765
  210    0.066534
  211    0.199305
  213    0.188395
  214    0.230742
  215    0.085271
  216    0.106572
  217    0.129422
  218    0.186047
  219    0.102522
  229    0.130199
  230    0.083299
  231    0.191205
  234    0.193175
  236    0.079365
  237    0.035638
  240    0.073584
  241    0.088222
  Name: tip_pct, dtype: float64),
 (('Sun', 'No'),
  0      0.059447
  1      0.160542
  2      0.166587
  3      0.139780
  4      0.146808
  5      0.186240
  6      0.228050
  7      0.116071
  8      0.130319
  9      0.218539
  10     0.166504
  11     0.141804
  12     0.101816
  13     0.162778
  14     0.203641
  15     0.181650
  16     0.161665
  17     0.227747
  18     0.206246
  41     0.145475
  42     0.219512
  43     0.136364
  44     0.184211
  45     0.164024
  46     0.224921
  47     0.185185
  48     0.071804
  49     0.166297
  50     0.199362
  51     0.252672
  52     0.149382
  53     0.156942
  54     0.169797
  55     0.180092
  112    0.105070
  113    0.106472
  114    0.155581
  115    0.202195
  116    0.169395
  150    0.177683
  151    0.152323
  152    0.158749
  153    0.081466
  154    0.101163
  155    0.172194
  156    0.103799
  157    0.150000
  158    0.194922
  159    0.121286
  160    0.162791
  161    0.197472
  162    0.123381
  163    0.144823
  165    0.141925
  166    0.107900
  167    0.141911
  185    0.241663
  Name: tip_pct, dtype: float64),
 (('Sun', 'Yes'),
  164    0.171331
  172    0.710345
  173    0.099843
  174    0.237812
  175    0.094529
  176    0.111794
  177    0.138122
  178    0.416667
  179    0.102512
  180    0.106205
  181    0.242177
  182    0.077178
  183    0.280535
  184    0.073983
  186    0.167464
  187    0.065660
  188    0.192837
  189    0.173160
  190    0.095602
  Name: tip_pct, dtype: float64),
 (('Thur', 'No'),
  77     0.147059
  78     0.131810
  79     0.156738
  81     0.204082
  82     0.181728
  84     0.127034
  85     0.148435
  86     0.153492
  87     0.218818
  88     0.236746
  89     0.141777
  117    0.140845
  118    0.144811
  119    0.121262
  120    0.197605
  121    0.125186
  122    0.175316
  123    0.125392
  124    0.201923
  125    0.140940
  126    0.173709
  127    0.137741
  128    0.175747
  129    0.095530
  130    0.078616
  131    0.139615
  132    0.134288
  133    0.163132
  134    0.177985
  135    0.146886
  136    0.193611
  137    0.141343
  139    0.208967
  140    0.200343
  141    0.195335
  142    0.121389
  143    0.184843
  144    0.139988
  145    0.179641
  146    0.072961
  147    0.137321
  148    0.176892
  149    0.266312
  195    0.190476
  243    0.159744
  Name: tip_pct, dtype: float64),
 (('Thur', 'Yes'),
  80     0.154321
  83     0.152999
  138    0.125000
  191    0.211509
  192    0.090014
  193    0.130491
  194    0.241255
  196    0.193424
  197    0.115982
  198    0.153846
  199    0.148038
  200    0.213789
  201    0.157771
  202    0.153846
  203    0.152439
  204    0.194837
  205    0.196114
  Name: tip_pct, dtype: float64)]

In [57]:
grouped_pct.agg("mean")

day   smoker
Fri   No        0.151650
      Yes       0.174783
Sat   No        0.158048
      Yes       0.147906
Sun   No        0.160113
      Yes       0.187250
Thur  No        0.160298
      Yes       0.163863
Name: tip_pct, dtype: float64

In [58]:
grouped_pct.mean()

day   smoker
Fri   No        0.151650
      Yes       0.174783
Sat   No        0.158048
      Yes       0.147906
Sun   No        0.160113
      Yes       0.187250
Thur  No        0.160298
      Yes       0.163863
Name: tip_pct, dtype: float64

In [59]:
grouped_pct.agg(["mean","std",peak_to_peak])

                 mean       std  peak_to_peak
day  smoker
Fri  No      0.151650  0.028123      0.067349
     Yes     0.174783  0.051293      0.159925
Sat  No      0.158048  0.039767      0.235193
     Yes     0.147906  0.061375      0.290095
Sun  No      0.160113  0.042347      0.193226
     Yes     0.187250  0.154134      0.644685
Thur No      0.160298  0.038774      0.193350
     Yes     0.163863  0.039389      0.151240

In [60]:
grouped_pct.agg([("average","mean"),("stdev","std"),("peak_to_peak",peak_to_peak)])

              average     stdev  peak_to_peak
day  smoker
Fri  No      0.151650  0.028123      0.067349
     Yes     0.174783  0.051293      0.159925
Sat  No      0.158048  0.039767      0.235193
     Yes     0.147906  0.061375      0.290095
Sun  No      0.160113  0.042347      0.193226
     Yes     0.187250  0.154134      0.644685
Thur No      0.160298  0.038774      0.193350
     Yes     0.163863  0.039389      0.151240

In [61]:
functions=["count","mean","max"]
result=grouped[["tip_pct","total_bill"]].agg(functions)
result

            tip_pct                     total_bill
              count      mean       max      count       mean    max
day  smoker
Fri  No           4  0.151650  0.187735          4  18.420000  22.75
     Yes         15  0.174783  0.263480         15  16.813333  40.17
Sat  No          45  0.158048  0.291990         45  19.661778  48.33
     Yes         42  0.147906  0.325733         42  21.276667  50.81
Sun  No          57  0.160113  0.252672         57  20.506667  48.17
     Yes         19  0.187250  0.710345         19  24.120000  45.35
Thur No          45  0.160298  0.266312         45  17.113111  41.19
     Yes         17  0.163863  0.241255         17  19.190588  43.11

In [62]:
result["tip_pct"]

             count      mean       max
day  smoker
Fri  No          4  0.151650  0.187735
     Yes        15  0.174783  0.263480
Sat  No         45  0.158048  0.291990
     Yes        42  0.147906  0.325733
Sun  No         57  0.160113  0.252672
     Yes        19  0.187250  0.710345
Thur No         45  0.160298  0.266312
     Yes        17  0.163863  0.241255

In [63]:
ftuples=[("Average","mean"),("Variance",np.var)]
grouped[["tip_pct","total_bill"]].agg(ftuples)

C:\Users\Karim.Badr\AppData\Local\Temp\ipykernel_25252\3377275874.py:2: FutureWarning: The provided callable <function var at 0x000002C07131FA60> is currently using SeriesGroupBy.var. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "var" instead.
  grouped[["tip_pct","total_bill"]].agg(ftuples)

              tip_pct           total_bill
              Average  Variance    Average    Variance
day  smoker
Fri  No      0.151650  0.000791  18.420000   25.596333
     Yes     0.174783  0.002631  16.813333   82.562438
Sat  No      0.158048  0.001581  19.661778   79.908965
     Yes     0.147906  0.003767  21.276667  101.387535
Sun  No      0.160113  0.001793  20.506667   66.099980
     Yes     0.187250  0.023757  24.120000  109.046044
Thur No      0.160298  0.001503  17.113111   59.625081
     Yes     0.163863  0.001551  19.190588   69.808518

In [64]:
grouped.agg({"tip":max,"size":sum})

C:\Users\Karim.Badr\AppData\Local\Temp\ipykernel_25252\973071891.py:1: FutureWarning: The provided callable <built-in function max> is currently using SeriesGroupBy.max. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "max" instead.
  grouped.agg({"tip":max,"size":sum})
C:\Users\Karim.Badr\AppData\Local\Temp\ipykernel_25252\973071891.py:1: FutureWarning: The provided callable <built-in function sum> is currently using SeriesGroupBy.sum. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "sum" instead.
  grouped.agg({"tip":max,"size":sum})

               tip  size
day  smoker
Fri  No       3.50     9
     Yes      4.73    31
Sat  No       9.00   115
     Yes     10.00   104
Sun  No       6.00   167
     Yes      6.50    49
Thur No       6.70   112
     Yes      5.00    40

In [65]:
grouped.agg({"tip_pct":["min","max","mean","std"],
             "size":"sum"})

              tip_pct                               size
                  min       max      mean       std  sum
day  smoker
Fri  No      0.120385  0.187735  0.151650  0.028123    9
     Yes     0.103555  0.263480  0.174783  0.051293   31
Sat  No      0.056797  0.291990  0.158048  0.039767  115
     Yes     0.035638  0.325733  0.147906  0.061375  104
Sun  No      0.059447  0.252672  0.160113  0.042347  167
     Yes     0.065660  0.710345  0.187250  0.154134   49
Thur No      0.072961  0.266312  0.160298  0.038774  112
     Yes     0.090014  0.241255  0.163863  0.039389   40

### Returning Aggregated Data Without Row Indexes

In [66]:
grouped = tips.groupby(["day", "smoker"], as_index=False)

In [67]:
grouped.mean(numeric_only=True)

    day smoker  total_bill       tip      size   tip_pct
0   Fri     No   18.420000  2.812500  2.250000  0.151650
1   Fri    Yes   16.813333  2.714000  2.066667  0.174783
2   Sat     No   19.661778  3.102889  2.555556  0.158048
3   Sat    Yes   21.276667  2.875476  2.476190  0.147906
4   Sun     No   20.506667  3.167895  2.929825  0.160113
5   Sun    Yes   24.120000  3.516842  2.578947  0.187250
6  Thur     No   17.113111  2.673778  2.488889  0.160298
7  Thur    Yes   19.190588  3.030000  2.352941  0.163863

## 10.3: Apply: General split-apply-combine

In [68]:
def top(df,n=5,column="tip_pct"):
    return df.sort_values(column,ascending=False)[:n]

In [69]:
top(tips,n=6)

     total_bill   tip smoker  day    time  size   tip_pct
172        7.25  5.15    Yes  Sun  Dinner     2  0.710345
178        9.60  4.00    Yes  Sun  Dinner     2  0.416667
67         3.07  1.00    Yes  Sat  Dinner     1  0.325733
232       11.61  3.39     No  Sat  Dinner     2  0.291990
183       23.17  6.50    Yes  Sun  Dinner     4  0.280535
109       14.31  4.00    Yes  Sat  Dinner     2  0.279525

In [70]:
tips.groupby("smoker").apply(top)

C:\Users\Karim.Badr\AppData\Local\Temp\ipykernel_25252\2530541573.py:1: DeprecationWarning: DataFrameGroupBy.apply operated on the grouping columns. This behavior is deprecated, and in a future version of pandas the grouping columns will be excluded from the operation. Either pass `include_groups=False` to exclude the groupings or explicitly select the grouping columns after groupby to silence this warning.
  tips.groupby("smoker").apply(top)

            total_bill   tip smoker   day    time  size   tip_pct
smoker
No     232       11.61  3.39     No   Sat  Dinner     2  0.291990
       149        7.51  2.00     No  Thur   Lunch     2  0.266312
       51        10.29  2.60     No   Sun  Dinner     2  0.252672
       185       20.69  5.00     No   Sun  Dinner     5  0.241663
       88        24.71  5.85     No  Thur   Lunch     2  0.236746
Yes    172        7.25  5.15    Yes   Sun  Dinner     2  0.710345
       178        9.60  4.00    Yes   Sun  Dinner     2  0.416667
       67         3.07  1.00    Yes   Sat  Dinner     1  0.325733
       183       23.17  6.50    Yes   Sun  Dinner     4  0.280535
       109       14.31  4.00    Yes   Sat  Dinner     2  0.279525

In [71]:
tips.groupby(["smoker","day"]).apply(top,n=1,column="total_bill")

C:\Users\Karim.Badr\AppData\Local\Temp\ipykernel_25252\470388052.py:1: DeprecationWarning: DataFrameGroupBy.apply operated on the grouping columns. This behavior is deprecated, and in a future version of pandas the grouping columns will be excluded from the operation. Either pass `include_groups=False` to exclude the groupings or explicitly select the grouping columns after groupby to silence this warning.
  tips.groupby(["smoker","day"]).apply(top,n=1,column="total_bill")

                 total_bill    tip smoker   day    time  size   tip_pct
smoker day
No     Fri  94        22.75   3.25     No   Fri  Dinner     2  0.142857
       Sat  212       48.33   9.00     No   Sat  Dinner     4  0.186220
       Sun  156       48.17   5.00     No   Sun  Dinner     6  0.103799
       Thur 142       41.19   5.00     No  Thur   Lunch     5  0.121389
Yes    Fri  95        40.17   4.73    Yes   Fri  Dinner     4  0.117750
       Sat  170       50.81  10.00    Yes   Sat  Dinner     3  0.196812
       Sun  182       45.35   3.50    Yes   Sun  Dinner     3  0.077178
       Thur 197       43.11   5.00    Yes  Thur   Lunch     4  0.115982

In [72]:
result=tips.groupby("smoker")["tip_pct"].describe()
result

,count,mean,std,min,25%,50%,75%,max
smoker,,,,,,,,
No,151.0,0.159328,0.039910,0.056797,0.136906,0.155625,0.185014,0.291990
Yes,93.0,0.163196,0.085119,0.035638,0.106771,0.153846,0.195059,0.710345

In [73]:
result.unstack("smoker")

       smoker
count  No        151.000000
       Yes        93.000000
mean   No          0.159328
       Yes         0.163196
std    No          0.039910
       Yes         0.085119
min    No          0.056797
       Yes         0.035638
25%    No          0.136906
       Yes         0.106771
50%    No          0.155625
       Yes         0.153846
75%    No          0.185014
       Yes         0.195059
max    No          0.291990
       Yes         0.710345
dtype: float64

### Suppressing the Group Keys

In [74]:
tips.groupby("smoker",group_keys=False).apply(top)

C:\Users\Karim.Badr\AppData\Local\Temp\ipykernel_25252\507294496.py:1: DeprecationWarning: DataFrameGroupBy.apply operated on the grouping columns. This behavior is deprecated, and in a future version of pandas the grouping columns will be excluded from the operation. Either pass `include_groups=False` to exclude the groupings or explicitly select the grouping columns after groupby to silence this warning.
  tips.groupby("smoker",group_keys=False).apply(top)

     total_bill   tip smoker   day    time  size   tip_pct
232       11.61  3.39     No   Sat  Dinner     2  0.291990
149        7.51  2.00     No  Thur   Lunch     2  0.266312
51        10.29  2.60     No   Sun  Dinner     2  0.252672
185       20.69  5.00     No   Sun  Dinner     5  0.241663
88        24.71  5.85     No  Thur   Lunch     2  0.236746
172        7.25  5.15    Yes   Sun  Dinner     2  0.710345
178        9.60  4.00    Yes   Sun  Dinner     2  0.416667
67         3.07  1.00    Yes   Sat  Dinner     1  0.325733
183       23.17  6.50    Yes   Sun  Dinner     4  0.280535
109       14.31  4.00    Yes   Sat  Dinner     2  0.279525

### Quantile and Bucket Analysis

In [75]:
frame=pd.DataFrame({"data1":np.random.standard_normal(1000),
                    "data2":np.random.standard_normal(1000)})
frame

        data1     data2
0    0.254421  1.356260
1   -0.911180 -0.029634
2   -0.691502  1.838154
3    0.762900 -0.557152
4   -1.569130  0.015494
..        ...       ...
995 -0.939175  1.265224
996 -1.291625  0.768810
997  1.420135  1.339135
998  0.663489  0.539755
999  1.209049 -1.446556

[1000 rows x 2 columns]

In [76]:
quartiles=pd.cut(frame["data1"],4)
quartiles

0      (-0.106, 1.738]
1      (-1.95, -0.106]
2      (-1.95, -0.106]
3      (-0.106, 1.738]
4      (-1.95, -0.106]
            ...
995    (-1.95, -0.106]
996    (-1.95, -0.106]
997    (-0.106, 1.738]
998    (-0.106, 1.738]
999    (-0.106, 1.738]
Name: data1, Length: 1000, dtype: category
Categories (4, interval[float64, right]): [(-3.801, -1.95] < (-1.95, -0.106] < (-0.106, 1.738] < (1.738, 3.581]]

In [79]:
grouped=frame.groupby(quartiles)
list(grouped)

C:\Users\Karim.Badr\AppData\Local\Temp\ipykernel_25252\1005871307.py:1: FutureWarning: The default of observed=False is deprecated and will be changed to True in a future version of pandas. Pass observed=False to retain current behavior or observed=True to adopt the future default and silence this warning.
  grouped=frame.groupby(quartiles)

[(Interval(-3.801, -1.95, closed='right'),
          data1     data2
  32  -2.151295  0.861908
  57  -2.067252  1.345355
  105 -2.337913  0.224396
  117 -2.125475 -0.339253
  191 -1.989087  0.612054
  219 -3.793970 -0.976552
  381 -2.016345 -0.821415
  403 -2.068639  0.475534
  468 -2.349988 -1.006029
  484 -1.977181  0.862709
  498 -2.287910  0.090032
  507 -2.537852 -1.119129
  526 -2.726256  1.357933
  535 -2.760784  0.133286
  587 -2.836531 -1.073713
  670 -2.039576  1.412466
  714 -2.398108  0.001677
  814 -2.483403 -1.271678),
 (Interval(-1.95, -0.106, closed='right'),
          data1     data2
  1   -0.911180 -0.029634
  2   -0.691502  1.838154
  4   -1.569130  0.015494
  6   -0.229663 -0.544760
  7   -0.257072  0.893398
  ..        ...       ...
  990 -0.534512 -0.720854
  991 -1.245445  1.681848
  992 -0.181796  0.909988
  995 -0.939175  1.265224
  996 -1.291625  0.768810

  [447 rows x 2 columns]),
 (Interval(-0.106, 1.738, closed='right'),
          data1     data2
  0    0.254421  1.356260
  3    0.762900 -0.557152
  5    1.089134  1.504596
  10   0.037509 -1.175823
  11   0.773987 -0.102562
  ..        ...       ...
  993  1.621623 -1.121354
  994  0.629118 -0.673609
  997  1.420135  1.339135
  998  0.663489  0.539755
  999  1.209049 -1.446556

  [495 rows x 2 columns]),
 (Interval(1.738, 3.581, closed='right'),
          data1     data2
  45   2.180031  0.419104
  85   1.885955  0.121797
  88   2.534622 -1.347113
  139  1.763462  1.135208
  164  1.940851 -1.889568
  193  1.912151 -0.310496
  248  2.536569 -0.418645
  300  2.347627 -0.226842
  307  1.976778 -0.407345
  309  2.748226 -0.482815
  312  2.464968  1.597816
  349  2.190648  0.673244
  416  1.800578 -0.461901
  417  1.756277 -0.449355
  452  1.849811  0.342656
  456  2.277532 -0.051462
  469  2.012443 -0.469756
  496  1.978684  1.170035
  510  3.268000 -0.549135
  512  1.754842  0.730900
  538  2.583789 -1.418770
  551  2.225482 -0.322482
  557  2.415938  0.254594
  575  1.990463  1.217348
  592  1.889060 -0.144792
  630  1.844410 -0.476686
  643  1.939450 -0.411634
  654  2.514746 -1.037258
  743  2.143243  0.305579
  751  2.957892  0.645301
  810  1.885267 -0.329577
  832  2.139526  0.122952
  833  1.912921  1.954218
  845  2.529020  0.325866
  879  3.581328 -1.442331
  897  1.949009  0.470919
  918  2.457714  0.193568
  924  2.410359  0.528193
  937  2.653155  0.621517
  975  2.203199 -1.799664)]

In [80]:
def get_stats(group):
    return pd.DataFrame(
        {"min":group.min(),
         "max":group.max(),
         "count":group.count(),
         "mean":group.mean()}
    )

In [82]:
grouped.apply(get_stats)

                            min       max  count      mean
data1
(-3.801, -1.95] data1 -3.793970 -1.977181     18 -2.385976
                data2 -1.271678  1.412466     18  0.042754
(-1.95, -0.106] data1 -1.943904 -0.107341    447 -0.771723
                data2 -2.828521  3.380168    447  0.021177
(-0.106, 1.738] data1 -0.104821  1.725515    495  0.643481
                data2 -3.523409  2.766562    495 -0.067226
(1.738, 3.581]  data1  1.754842  3.581328     40  2.235151
                data2 -1.889568  1.954218     40 -0.040420

In [83]:
grouped.agg(["min","max","count","mean"])

                    data1                               data2                  \
                      min       max count      mean       min       max count
data1
(-3.801, -1.95] -3.793970 -1.977181    18 -2.385976 -1.271678  1.412466    18
(-1.95, -0.106] -1.943904 -0.107341   447 -0.771723 -2.828521  3.380168   447
(-0.106, 1.738] -0.104821  1.725515   495  0.643481 -3.523409  2.766562   495
(1.738, 3.581]   1.754842  3.581328    40  2.235151 -1.889568  1.954218    40


                     mean
data1
(-3.801, -1.95]  0.042754
(-1.95, -0.106]  0.021177
(-0.106, 1.738] -0.067226
(1.738, 3.581]  -0.040420

In [86]:
quartiles_samp=pd.qcut(frame["data1"],4,labels=False)
quartiles_samp

0      2
1      0
2      0
3      3
4      0
      ..
995    0
996    0
997    3
998    2
999    3
Name: data1, Length: 1000, dtype: int64

In [87]:
grouped=frame.groupby(quartiles_samp)
list(grouped)

[(0,
          data1     data2
  1   -0.911180 -0.029634
  2   -0.691502  1.838154
  4   -1.569130  0.015494
  8   -1.527563 -0.491903
  16  -1.606006  2.171310
  ..        ...       ...
  988 -1.521148  0.185460
  989 -0.874726  0.539176
  991 -1.245445  1.681848
  995 -0.939175  1.265224
  996 -1.291625  0.768810

  [250 rows x 2 columns]),
 (1,
          data1     data2
  6   -0.229663 -0.544760
  7   -0.257072  0.893398
  9   -0.152082 -0.352122
  13  -0.381930 -1.267709
  14  -0.149354  1.229564
  ..        ...       ...
  979 -0.314882 -0.151033
  984 -0.344270  0.118844
  985 -0.172584 -0.844218
  990 -0.534512 -0.720854
  992 -0.181796  0.909988

  [250 rows x 2 columns]),
 (2,
          data1     data2
  0    0.254421  1.356260
  10   0.037509 -1.175823
  12   0.615727 -0.630565
  18   0.210930 -1.471205
  24   0.690763 -0.422210
  ..        ...       ...
  972  0.583677  0.273813
  976  0.669307  0.115351
  986  0.085733  0.200805
  994  0.629118 -0.673609
  998  0.663489  0.539755

  [250 rows x 2 columns]),
 (3,
          data1     data2
  3    0.762900 -0.557152
  5    1.089134  1.504596
  11   0.773987 -0.102562
  17   1.559107 -0.251384
  22   0.854519 -2.065883
  ..        ...       ...
  981  1.058854 -1.625466
  982  0.823945 -0.658600
  993  1.621623 -1.121354
  997  1.420135  1.339135
  999  1.209049 -1.446556

  [250 rows x 2 columns])]

In [88]:
grouped.apply(get_stats)

                  min       max  count      mean
data1
0     data1 -3.793970 -0.626807    250 -1.240403
      data2 -2.480133  2.761004    250  0.001985
1     data1 -0.625399  0.009985    250 -0.318570
      data2 -2.828521  3.380168    250  0.012243
2     data1  0.010625  0.694230    250  0.341334
      data2 -3.523409  2.250345    250 -0.059259
3     data1  0.697223  3.581328    250  1.297725
      data2 -2.073436  2.766562    250 -0.053599

### Example: Filling Missing Values with Group-Specific Values